{
    "open_para": {
        "software": "I am writing this letter to express my interest in the {position} position at {company_name}. I am confident that I will be an asset to your team with over a decade of experience as a military marine engineering officer and recent data science diploma completion.",
        "datascience": "I am writing this letter to express my interest in the {position} position at {company_name}. I am confident that I will be an asset to your team with over a decade of experience as a military marine engineering officer and recent data science diploma completion.",
        "web": "I am writing this letter to express my interest in the {position} position at {company_name}.  I am confident that I will be an asset to your team with over a decade of experience as a military marine engineering officer and recent data science diploma completion."
    },
    "learningNewTech": "I have been curious about {technology} for a while now. Still, I have only had time to play with it on personal projects. What's so exciting about this opportunity is that I have been looking for a role that allows me to use these skills and technologies in a professional capacity. I am very excited and willing to learn if you are ready to let me, and I think this is just a great opportunity.",
    "recentExperience": "My most recent experience was from July 2018 to September 2020 at the Fleet Maintenance Facility Cape Breton (FMFCB) as the Deputy Program Manager. While my duties ranged from general military administration, technical expertise, and junior subordinates training, I performed small data analytics functions in the form of small weekly reports about the program's work output. While Python was not available at my workplace, I automated my work with Excel-VBA, which led me to learn more about automation.",
    "github": "",
    "closing": "Thank you very much for considering my application, and I look forward with talking with you about how my skills will significantly help {company_name}. If I am not a fit for this specific opportunity, I am flexible and willing to take other positions that may better fit my qualification. I can be reached by phone at {phone} or by email at {mail}. For more information about me, please visit {github}.",
    "website": "",
    "email": "",
    "otherExperience": "My previous engineering experience was not software but marine (mechanical) as I worked as a Marine system Engineering Officer from 2007 to 2020. In 2018 I earned a marine engineering head of department qualification demonstrating a solid grasp of my leadership abilities, personnel and time management and my ability to brief non-technical superiors. I also directed warship repair and maintenance activities between the ship and the repair facility",
    "name": "",
    "projects": {
        "computerVision": "For my data science bootcamp final project I created a grocery store flyers scraper to help my wife find and keep track of weekly deals as she is very thrifty. I trained two Convoluted Neural Network(CNN), one to identify merchandise box and another to read the price numbers, using the You Only Look Once (YOLO) model. I created a web crawler to create an image dataset. I labelled the data using labelImg, transformed the data using ImgAug and stored all the data in a mongo database.",
        "dataStructureApp": "I was inspired by freeCodeCamp.org data structure lecture to model each and every type of data structure using Python and create a command Line software to interact with them. The app is available as a Docker container and available on my docker hub account. I am still working on the project since implementing each data structure model takes time.",
        "tutorialPaper": "Lighthouse Lab bootcamp course delivery was fast-paced, and unfortunately, I wasn't able to master every subject taught. After the Bootcamp, I created a series of tutorials and papers to teach myself and my peers how to master subjects like Docker with comprehensive examples and code hosted on GitHub.",
        "databases": "During my diploma, I demonstrated an affinity with databases (SQL and NOSQL) where I helped many of my classmates with SQL questions. This led me to take a university online course: COMP 418: Database tuning, to expand my knowledge on the subject.",
        "django": "While most of my experience is with data science, I am currently learning more about web and web development by creating my own website using Django and a Postgres database."
    },
    "company_name": "Bro inc",
    "technology": {
        "software": "Python and SQL",
        "datascience": "Python, PyTorch and SQL",
        "web": "HTML, React, TS and GraphQL"
    },
    "phone": "",
    "position": "bro scientist",
    "address": "",
    "mail": ""
}
